app/views/sports/_form.html.erb

            <div class="col-md-6">
                <%= f.select :sport_categorie_id, SportCategorie.pluck(:name, :id), {}, class: 'form-control' %>
---
SELECT `sport_categories`.`name`, `sport_categories`.`id` FROM `sport_categories`