app/views/sports/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`sport_id` = 4
---

     <% @sport.posts.each do |post| %>