app/views/users/show.html.erb

<% @followers.each do |follower| %>
  <p><%=User.find_by_id(follower.follower_id).firstname  %>
---
SELECT `follows`.* FROM `follows` WHERE `follows`.`follower_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]

<% @followees.each do |followee| %>
  <p><%= User.find_by_id(followee.followee_id).firstname %></p>
---
SELECT `follows`.* FROM `follows` WHERE `follows`.`followee_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1