app/views/posts/_form.html.erb

            <div class="col-md-6">
                <%= f.select :sport_id, current_user.sports.pluck(:name, :id), {}, class: 'form-control' %>
---
SELECT `sports`.`name`, `sports`.`id` FROM `sports` WHERE `sports`.`user_id` = 7