app/controllers/application_controller.rb

    def current_user
        return nil if !session[:auth] || !session[:auth]['id']
        return @_user if @_user
        @_user = User.find_by_id(session[:auth]['id'])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1