app/controllers/follows_controller.rb

class FollowsController < ApplicationController
    before_action do
        @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def create
        @user.followers << current_user
---
INSERT INTO `follows` (`follower_id`, `followee_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-03-03 21:36:04.222989', '2020-03-03 21:36:04.222989')