app/controllers/pages_controller.rb

SELECT `posts`.* FROM `posts` LIMIT 10
SELECT `sport_categories`.* FROM `sport_categories`
SELECT `users`.* FROM `users` LIMIT 5
---
  def index
    @posts = Post.limit(10)
    @sport_categories = SportCategorie.all
    @users = User.limit(5)