app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
  def followeePosts(ids)
    #retourne les 5 derniers posts de chacun de ses abonnements dans un array.
    users = User.where({id: ids})
    length = ids.length
    filter = []


    if length != 0
        for i in (0..(length-1))
          if users[i] != nil # Si jamais un utilisateur a été supprimé, il sera nil
            if users[i].posts.all.length > 4