app/controllers/posts_controller.rb

  def me
    @posts = current_user.posts.all
---
SELECT `posts`.`id` FROM `posts` WHERE `posts`.`user_id` = 1

  def index
    user_ids = current_user.followed_users.pluck(:id)
    @posts = Post.joins(:user).where(users: {id: user_ids})
---
SELECT `posts`.* FROM `posts` INNER JOIN users_posts ON users_posts.post_id = posts.id WHERE (users_posts.user_id IN (1))

  def categories

    @categories = SportCategorie.find_by_slug!(params[:slug])
---
SELECT `sport_categories`.* FROM `sport_categories` WHERE `sport_categories`.`slug` = 'rugbyXV' LIMIT 1

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `content`, `sport_id`, `created_at`, `updated_at`, `user_id`) VALUES ('EDF', 'Premier match en équipe de france', 2, '2020-03-04 19:33:37.408176', '2020-03-04 19:33:37.408176', 1)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `posts`.`content` = 'essai d\'Anthony Boutier', `posts`.`updated_at` = '2020-03-04 19:38:17.357168' WHERE `posts`.`id` = 4

    def set_post
      @post = current_user.posts.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1 AND `posts`.`id` = 3 LIMIT 1