app/controllers/sessions_controller.rb

  def create
    user_params = params.require(:user)

    # Pour confirmation mail rajouter confirmed = 1 AND
    @user = User.where('(username = :username OR email = :username)', username: user_params[:username]).first
---
SELECT `users`.* FROM `users` WHERE (confirmed = 1 AND (username = 'jul' OR email = 'jul')) ORDER BY `users`.`id` ASC LIMIT 1