app/controllers/sports_controller.rb

    def show
        @sport = Sport.find(params[:id])
---
SELECT `sports`.* FROM `sports` WHERE `sports`.`id` = 2 LIMIT 1

    def create
        @sport = current_user.sports.new(sport_params)

        if @sport.save
---
INSERT INTO `sports` (`name`, `frequence`, `date_begin`, `user_id`, `sport_categorie_id`, `created_at`, `updated_at`) VALUES ('rugby amateur', 3, '2020-03-04', 1, 1, '2020-03-04 19:32:44.542052', '2020-03-04 19:32:44.542052')

    def update
        if @sport.update(sport_params)
---
UPDATE `sports` SET `sports`.`frequence` = 5, `sports`.`updated_at` = '2020-02-29 13:40:32.583790' WHERE `sports`.`id` = 2

    def destroy


        @sport = Sport.find(params[:id])
        if @sport.present?
            @sport.destroy
---
SELECT `sports`.* FROM `sports` WHERE `sports`.`id` = 2 LIMIT 1
SELECT `sports`.* FROM `sports` WHERE `sports`.`id` = 1 LIMIT 1
DELETE FROM `sports` WHERE `sports`.`id` = 2

    def set_sport

       @sport = current_user.sports.find(params[:id])
---
SELECT `sports`.* FROM `sports` WHERE `sports`.`user_id` = 1 AND `sports`.`id` = 2 LIMIT 1