app/controllers/sport_categories_controller.rb

    def index
        @sport_categories = SportCategorie.all
---
SELECT `sport_categories`.* FROM `sport_categories`

    def create

        @sport_categorie = SportCategorie.new(sport_categorie_params)
        if @sport_categorie.save
---
INSERT INTO `sport_categories` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('gymnastique artistique', 'gymart', '2020-03-07 10:41:38.746779', '2020-03-07 10:41:38.746779')