app/controllers/users_controller.rb

    def create
        user_params = params.require(:user).permit(:username, :email, :lastname, :firstname, :password, :password_confirmation)
        @user = User.new(user_params)

        if @user.valid?

            @user.save
---
INSERT INTO `users` (`username`, `email`, `confirmation_token`, `password_digest`, `firstname`, `lastname`, `created_at`, `updated_at`) VALUES ('lorenzo', 'lorenzo@icloud.com', 'cUNqoMBfY5X92fJt3bc7cU7C', '$2a$12$Bx8Ock/UotWsj1f30aRcauChZJl9GO9C9TGBV22Gaz7QHKbZixt3.', 'lorenzo', 'lorenzo', '2020-03-03 21:02:21.193746', '2020-03-03 21:02:21.193746')

    def confirm
        @user = User.find(params[:id])

        if @user.confirmation_token == params[:token]

            @user.update_attributes(confirmed: true, confirmation_token: nil)

            @user.save(validate: false)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`confirmation_token` = NULL, `users`.`confirmed` = TRUE, `users`.`updated_at` = '2020-03-03 21:02:33.583543' WHERE `users`.`id` = 1
UPDATE `users` SET `users`.`firstname` = 'grfbd', `users`.`lastname` = 'rgdf', `users`.`sport` = 'dag', `users`.`updated_at` = '2020-02-27 15:22:00.417877' WHERE `users`.`id` = 6

    def update
        @user = current_user
        user_params = params.require(:user).permit(:username, :firstname, :lastname, :email, :sport, :photo_file)
        if @user.update(user_params)
---
UPDATE `users` SET `users`.`sport` = '', `users`.`photo` = TRUE, `users`.`updated_at` = '2020-03-04 21:17:33.102711' WHERE `users`.`id` = 1