app/models/user.rb

    def followedBy?(user)
        following_users.where(follower_id: user.id).count > 0 if user.respond_to? :id
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]

    def followToUsername(id)
        User.find_by_id(id).username
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1  [["id", 2], ["LIMIT", 1]]

    def followeePosts(ids)
        #retourne les 5 derniers posts de chacun de ses abonnements dans un array.
        users = User.where({id: ids})
        length = ids.length
        filter = []


        if length != 0
            for i in (0..(length-1))
                if users[i].posts.all.length > 4
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 8
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1