app/models/user.rb

SELECT `follows`.`id` FROM `follows` WHERE `follows`.`follower_id` = 2
---
    def followerToUser(follower)
        User.find(user_id: follower.follower_id)